Config = {}

--------------------------------------------------
-- 🟩 إعدادات الأوامر Command Settings
--------------------------------------------------
-- تقدر تضيف أوامر جديدة بسهولة هنا
-- لكل أمر: Webhook + الصلاحيات
--------------------------------------------------

Config.Commands = {
    ["خارج"] = {
        webhook = "https://discord.com/api/webhooks/1442159901899231353/skQcv_DyQ7lScNeKuWkAEZ6cYgt56li-fl3HoCpUEipq3HBFqJsVj0-9SNXqwCQmbSzK",     -- الويبهوك الخاص بأمر /خارج
        groups  = { "user", "admin", "superadmin" },
        color   = 16753920                      -- لون الإيمبد (اختياري)
    },

    ["تخريب"] = {
        webhook = "https://discord.com/api/webhooks/1442159901899231353/skQcv_DyQ7lScNeKuWkAEZ6cYgt56li-fl3HoCpUEipq3HBFqJsVj0-9SNXqwCQmbSzK",     -- الويبهوك الخاص بأمر /تخريب
        groups  = { "admin", "superadmin", "supermod", "modplus", "mod", "trainmod" },
        color   = 16711680                      -- أحمر داكن
    },

    ["help"] = {
        webhook = "https://discord.com/api/webhooks/1442160005028647129/swkkd6Pl9VeBqWXwO-rrvddvm7qHgs5212bfKSX-Wk4FPwKm8VZMRta-Zs-yDFSQU-_9",
        groups  = { "user", "admin", "superadmin" },
        color   = 65314                         -- أزرق فاتح
    }
}

--------------------------------------------------
-- 🟩 منشن عام لكل الويبهوكات
--------------------------------------------------
-- @everyone أو @here أو <@&ROLEID>
--------------------------------------------------
Config.GlobalMention = "@everyone"


--------------------------------------------------
-- 🟩 اسم الويبهوك
--------------------------------------------------
Config.WebhookUsername = "سجل الأوامر"


--------------------------------------------------
-- 🟩 اللون الافتراضي للإيمبد إذا لم نحدد color لكل أمر
--------------------------------------------------
Config.DefaultColor = 16711680  -- أحمر
